---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCFile Properties
IFCFile Class See Also Send Feedback
---

The IFCFile type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

IFCFile Class

Autodesk.Revit.DB.IFC Namespace